ycsb-results/mssql/f/rc20-op10/tc2/run2.txt
/usr/bin/java  -classpath /home/atz2nd/Desktop/editycsb/YCSB/conf:/home/atz2nd/Desktop/editycsb/YCSB/core/target/core-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/HdrHistogram-2.1.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/htrace-core4-4.1.0-incubating.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-core-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/core/target/dependency/jackson-mapper-asl-1.9.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/src/main/conf:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/jdbc-mssql-binding-0.17.0-SNAPSHOT.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/HdrHistogram-2.1.9.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/commons-collections-3.2.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/commons-lang-2.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/commons-pool-1.5.4.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/geronimo-jms_1.1_spec-1.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/geronimo-jta_1.1_spec-1.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/htrace-core4-4.2.0-incubating.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/mssql-jdbc-6.4.0.jre8.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/openjpa-jdbc-2.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/openjpa-kernel-2.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/openjpa-lib-2.1.1.jar:/home/atz2nd/Desktop/editycsb/YCSB/mssql/target/dependency/serp-1.13.1.jar com.yahoo.ycsb.Client -t -db com.yahoo.ycsb.db.JdbcDBClient -s -P /home/atz2nd/Desktop/editycsb/YCSB/mssql/db.properties -P /home/atz2nd/Desktop/editycsb/YCSB/workloads/workloadf -p recordcount=20 -threads 2 -p operationcount=10
Adding shard node URL: jdbc:sqlserver://localhost:1433;databaseName=ycsb
Adding shard node URL: jdbc:sqlserver://localhost:1433;databaseName=ycsb
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[OVERALL], RunTime(ms), 742
[OVERALL], Throughput(ops/sec), 13.477088948787062
[TOTAL_GCS_PS_Scavenge], Count, 0
[TOTAL_GC_TIME_PS_Scavenge], Time(ms), 0
[TOTAL_GC_TIME_%_PS_Scavenge], Time(%), 0.0
[TOTAL_GCS_PS_MarkSweep], Count, 0
[TOTAL_GC_TIME_PS_MarkSweep], Time(ms), 0
[TOTAL_GC_TIME_%_PS_MarkSweep], Time(%), 0.0
[TOTAL_GCs], Count, 0
[TOTAL_GC_TIME], Time(ms), 0
[TOTAL_GC_TIME_%], Time(%), 0.0
[READ], Operations, 10
[READ], AverageLatency(us), 28715.4
[READ], MinLatency(us), 1951
[READ], MaxLatency(us), 73407
[READ], 95thPercentileLatency(us), 73407
[READ], 99thPercentileLatency(us), 73407
[READ], Return=OK, 10
[READ-MODIFY-WRITE], Operations, 3
[READ-MODIFY-WRITE], AverageLatency(us), 124896.0
[READ-MODIFY-WRITE], MinLatency(us), 65536
[READ-MODIFY-WRITE], MaxLatency(us), 168831
[READ-MODIFY-WRITE], 95thPercentileLatency(us), 168831
[READ-MODIFY-WRITE], 99thPercentileLatency(us), 168831
[CLEANUP], Operations, 2
[CLEANUP], AverageLatency(us), 179.5
[CLEANUP], MinLatency(us), 73
[CLEANUP], MaxLatency(us), 286
[CLEANUP], 95thPercentileLatency(us), 286
[CLEANUP], 99thPercentileLatency(us), 286
[UPDATE], Operations, 3
[UPDATE], AverageLatency(us), 89872.0
[UPDATE], MinLatency(us), 52416
[UPDATE], MaxLatency(us), 135167
[UPDATE], 95thPercentileLatency(us), 135167
[UPDATE], 99thPercentileLatency(us), 135167
[UPDATE], Return=OK, 3